/* This is a mapping of BRError code failures to localized recovery suggestions */

/* kBRMediaPlayerSongPlaybackError*/
201 = "To return to the previous screen, press the Menu button.";

/* kBRMediaPlayerNotResponding*/
202 = "To return to the previous screen, press the Menu button.";


/* kBRMediaNoMovieFolderContent */
304 = "Make sure movies you create or download are in your Movies folder in your home folder.";

/* kBRMediaEmptyPlaylist */
310 = "";

/* kBRMediaNoSuchPlaylist */
311 = "Select another playlist.";

/* kBRMediaNoSuchSong */
312 = "Select another song.";

/* kBRMediaNoSongForSlideshow */
316 = "Check your slideshow music settings and try again.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Check your slideshow music settings and try again.";

/* kBRVideoUnplayable */
318 = "The format was not recognized.";

/* kBRMediaRadioStreamUnplayable */
319 = "The radio stream timed out before it could be played.";


/* kBRRemoteMediaNoContent*/
350 = "";

/* kBRRemoteMediaNoPhotoContent */
351 = "";

/* kBRRemoteMediaNoPodcastContent */
352 = "";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "";

/* kBRRemoteMediaNoTVShowContent */
355 = "";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "";

/* kBRRemoteMediaNoPlaylists */
357 = "";

/* kBRRemoteMediaNoSongContent */
358 = "";

/* kBRRemoteMediaNoAudioBookContent */
359 = "";

/* kBRRemoteMediaEmptyPlaylist */
360 = "";

/* kBRRemoteMediaLoadingError */
361 = "Check the source or try again later.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "Check the source or try again later.";

/* kBRDataSourceConnectionInProgressError */
420 = "Please wait.";

/* KBRSystemNetworkHostUnreachable */
501 = "Check your network configuration and connection.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "The Apple Theatrical Trailer website is unavailable. Try again later.";

/* kBRSystemNotHDCPCompliant */
503 = "To watch this content, make sure the connected displays support HDCP.";

/* kBRSetupCantSetLanguage */
600 = "Try again.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Another application is playing a DVD. Return to the desktop to quit the other application and try again.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "Another application is playing the DVD. Return to the desktop to quit the other application.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "To learn more about region codes, see the DVD Player help.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "The format was not recognized.";

/* kBRDVDErrorFatalDVDAlert */
754 = "There is a problem with the disc.";

/* kBRCDErrorCantEjectCDAlert */
755 = "Another application is using the CD. Return to the desktop to quit the other application and try again.";


/* kBRInternalResourceError */
900 = "";


